UFOIO/AMKN8639/BL_BUILD/src_orig/stm32h7xx_regs.h
/************************************************************************************
*  File name: stm32h7xx_regs.h
*  Project  : AMKN8639 self-developed Bootloader
*  Description: 自定义 STM32H743 寄存器结构 (零依赖, 不引厂商 HAL/CMSIS)
*                - 包含 BL 需要的最小外设: RCC / GPIOD / USART1 / I2C1 / FLASH
*                - 基于 ST 参考手册 RM0433 (H743)
*                - 全部 volatile, 无 .lib 依赖
*
*  Modify History:
*   1. Version: 1.0
*      Date:    2026.6.22
*      Modify:  Phase 3.2 - 自定义寄存器 (零依赖)
*
*************************************************************************************/
#ifndef __STM32H7XX_REGS_H__
#define __STM32H7XX_REGS_H__

#include <stdint.h>

/*============================================================================
 * 基础类型
 *===========================================================================*/
typedef volatile uint32_t  REG32;
typedef volatile uint16_t  REG16;
typedef volatile uint8_t   REG8;

/*============================================================================
 * RCC base
 *===========================================================================*/
#define RCC_BASE                0x58024400UL
typedef struct {
    REG32 CR;           /* 0x00 */
    REG32 HSICFGR;      /* 0x04 */
    REG32 CRRCR;        /* 0x08 */
    REG32 CSICFGR;      /* 0x0C */
    REG32 CFGR;         /* 0x10 */
    REG32 Reserved1;    /* 0x14 */
    REG32 D1CFGR;       /* 0x18 */
    REG32 D2CFGR;       /* 0x1C */
    REG32 D3CFGR;       /* 0x20 */
    REG32 Reserved2;    /* 0x24 */
    REG32 PLLCKSELR;    /* 0x28 */
    REG32 PLLCFGR;      /* 0x2C */
    REG32 PLL1DIVR;     /* 0x30 */
    REG32 PLL1FRACR;    /* 0x34 */
    REG32 PLL2DIVR;     /* 0x38 */
    REG32 PLL2FRACR;    /* 0x3C */
    REG32 PLL3DIVR;     /* 0x40 */
    REG32 PLL3FRACR;    /* 0x44 */
    REG32 Reserved3;    /* 0x48 */
    REG32 CDCCIPR;      /* 0x4C */
    REG32 CDCCIP1R;     /* 0x50 */
    REG32 CDCCIP2R;     /* 0x54 */
    REG32 SRDCFGR;      /* 0x58 */
    REG32 Reserved4;    /* 0x5C */
    REG32 CIER;         /* 0x60 */
    REG32 CIFR;         /* 0x64 */
    REG32 CICR;         /* 0x68 */
    REG32 Reserved5;    /* 0x6C */
    REG32 BDCR;         /* 0x70 */
    REG32 CSR;          /* 0x74 */
    REG32 Reserved6;    /* 0x78 */
    REG32 AHB1RSTR;     /* 0x7C */
    REG32 AHB2RSTR;     /* 0x80 */
    REG32 AHB3RSTR;     /* 0x84 */
    REG32 AHB4RSTR;     /* 0x88 - GPIO D-H reset */
    REG32 APB1LRSTR;    /* 0x8C - I2C1 reset */
    REG32 APB1HRSTR;    /* 0x90 */
    REG32 APB2RSTR;     /* 0x94 - USART1 reset */
    REG32 APB3RSTR;     /* 0x98 */
    REG32 APB4RSTR;     /* 0x9C */
    REG32 GCR;          /* 0xA0 */
    REG32 Reserved7;    /* 0xA4 */
    REG32 D3AMR;        /* 0xA8 */
    REG32 Reserved8[9]; /* 0xAC-0xCC */
    REG32 RSR;          /* 0xD0 */
    REG32 AHB3ENR;      /* 0xD4 */
    REG32 AHB1ENR;      /* 0xD8 */
    REG32 AHB2ENR;      /* 0xDC */
    REG32 AHB4ENR;      /* 0xE0 - GPIO D-H enable */
    REG32 APB3ENR;      /* 0xE4 - APB3 peripheral enable (BL 不访问) */
    REG32 APB1LENR;     /* 0xE8 - I2C1 enable bit 21, USART3EN bit 18 (probe-verified) */
    REG32 APB1HENR;     /* 0xEC */
    REG32 APB2ENR;      /* 0xF0 - USART1 enable, bit 4 (verified empirically) */
    REG32 APB4ENR;      /* 0xF4 */
} RCC_TypeDef;

#define RCC                     ((RCC_TypeDef *)RCC_BASE)

/* RCC bit fields */
#define RCC_AHB4ENR_GPIOAEN     (1UL << 0)    /* GPIOA clock enable */
#define RCC_AHB4ENR_GPIOBEN     (1UL << 1)    /* GPIOB clock enable */
#define RCC_AHB4ENR_GPIODEN     (1UL << 3)    /* GPIOD clock enable */
#define RCC_AHB4ENR_GPIOFEN     (1UL << 5)    /* GPIOF clock enable (PF8/PF9 for W25Q64) */
#define RCC_AHB4ENR_GPIOGEN     (1UL << 6)    /* GPIOG clock enable */
#define RCC_AHB4ENR_GPIOHEN     (1UL << 7)    /* GPIOH clock enable */
#define RCC_AHB4ENR_GPIOIEN     (1UL << 8)    /* GPIOI clock enable */
#define RCC_APB1LENR_USART3EN   (1UL << 18)   /* USART3 clock enable (PB10/PB11) */
#define RCC_APB1LENR_I2C1EN     (1UL << 21)   /* I2C1 clock enable */
#define RCC_APB1LENR_I2C2EN     (1UL << 22)   /* I2C2 clock enable (Modify 2026.6.23 P1.5 v7) */
#define RCC_APB2ENR_USART1EN    (1UL << 4)    /* USART1 clock enable */
/* Modify 2026.6.23: AHB3 时钟 — QUADSPI 在这里 (W25Q64) */
#define RCC_AHB3ENR_QUADSPIEN   (1UL << 14)   /* QUADSPI clock enable */

/* Modify 2026.6.24 v18 P1.5: AHB3 复位 — 解决 BUSY 卡死 */
#define RCC_AHB3RSTR_QUADSPIRST (1UL << 14)   /* QUADSPI peripheral reset (H743 RM0433 8.7.30) */

/* Modify 2026.6.23 P1.5 v4: I2C1 时钟源选择 (RCC->D2CCIP2R bit 13:12 — I2C123SEL 共享) */
#define RCC_BASE_D2CCIP2R       (RCC_BASE + 0x54UL)   /* D2 peripherals clock config 2 */
#define RCC_D2CCIP2R_I2C123SEL_Pos (12U)
#define RCC_D2CCIP2R_I2C123SEL_Msk (3UL << RCC_D2CCIP2R_I2C123SEL_Pos)
#define RCC_D2CCIP2R_I2C123SEL_PCLK1    (0UL << RCC_D2CCIP2R_I2C123SEL_Pos)
#define RCC_D2CCIP2R_I2C123SEL_PLL3R    (1UL << RCC_D2CCIP2R_I2C123SEL_Pos)
#define RCC_D2CCIP2R_I2C123SEL_HSIKER   (2UL << RCC_D2CCIP2R_I2C123SEL_Pos)  /* hsi_ker_ck = 16MHz */
#define RCC_D2CCIP2R_I2C123SEL_CSIKER   (3UL << RCC_D2CCIP2R_I2C123SEL_Pos)
#define REG_D2CCIP2R            ((volatile uint32_t *)RCC_BASE_D2CCIP2R)

/* Modify 2026.6.23 P1.5 v10: 绝对地址访问 APB1LENR (RCC 偏移 0xE8) */
#define RCC_BASE_APB1LENR       (RCC_BASE + 0xE8UL)
#define REG_APB1LENR            ((volatile uint32_t *)RCC_BASE_APB1LENR)

/*============================================================================
 * GPIO base (GPIOD for DI1=PD11)
 *  H743 GPIO 寄存器:
 *   MODER  = 0x00
 *   OTYPER = 0x04
 *   OSPEEDR= 0x08
 *   PUPDR  = 0x0C
 *   IDR    = 0x10
 *   ODR    = 0x14
 *   BSRR   = 0x18
 *   LCKR   = 0x1C
 *   AFR[0] = 0x20
 *   AFR[1] = 0x24
 *===========================================================================*/
#define GPIOA_BASE              0x58020000UL
#define GPIOB_BASE              0x58020400UL
#define GPIOD_BASE              0x58020C00UL
/* Modify 2026.6.23: 加 GPIOF — W25Q64 用 PF8/PF9 (IO0/IO1) */
#define GPIOF_BASE              0x58021400UL
#define GPIOG_BASE              0x58021800UL
#define GPIOH_BASE              0x58021C00UL
#define GPIOI_BASE              0x58022000UL
typedef struct {
    REG32 MODER;        /* 0x00 */
    REG32 OTYPER;       /* 0x04 */
    REG32 OSPEEDR;      /* 0x08 */
    REG32 PUPDR;        /* 0x0C */
    REG32 IDR;          /* 0x10 */
    REG32 ODR;          /* 0x14 */
    REG32 BSRR;         /* 0x18 */
    REG32 LCKR;         /* 0x1C */
    REG32 AFR[2];       /* 0x20, 0x24 */
    REG32 Reserved;     /* 0x28 */
    REG32 BRR;          /* 0x28 (alias) */
    REG32 Reserved2;    /* 0x2C */
} GPIO_TypeDef;

#define GPIOA                   ((GPIO_TypeDef *)GPIOA_BASE)
#define GPIOB                   ((GPIO_TypeDef *)GPIOB_BASE)
#define GPIOD                   ((GPIO_TypeDef *)GPIOD_BASE)
#define GPIOF                   ((GPIO_TypeDef *)GPIOF_BASE)
#define GPIOG                   ((GPIO_TypeDef *)GPIOG_BASE)
#define GPIOH                   ((GPIO_TypeDef *)GPIOH_BASE)
#define GPIOI                   ((GPIO_TypeDef *)GPIOI_BASE)

