UFOIO/AMKN8639/BL_BUILD/src_orig/stm32h7xx_regs.h
/* GPIO mode */
#define GPIO_MODE_INPUT         0x0   /* 00: Input */
#define GPIO_MODE_OUTPUT        0x1   /* 01: General purpose output */
#define GPIO_MODE_AF            0x2   /* 10: Alternate function */
#define GPIO_MODE_ANALOG        0x3   /* 11: Analog */

/*============================================================================
 * USART1 base (PA9/PA10)
 *   0x40011000
 *   CR1  = 0x00
 *   CR2  = 0x04
 *   CR3  = 0x08
 *   BRR  = 0x0C
 *   GTPR = 0x10
 *   RTOR = 0x14
 *   RQR  = 0x18
 *   ISR  = 0x1C
 *   ICR  = 0x20
 *   RDR  = 0x24
 *   TDR  = 0x28
 *===========================================================================*/
#define USART1_BASE             0x40011000UL
#define USART3_BASE             0x40004800UL
typedef struct {
    REG32 CR1;          /* 0x00 */
    REG32 CR2;          /* 0x04 */
    REG32 CR3;          /* 0x08 */
    REG32 BRR;          /* 0x0C */
    REG16 GTPR;         /* 0x10 */
    uint16_t Reserved1;
    REG32 RTOR;         /* 0x14 */
    REG32 RQR;          /* 0x18 */
    REG32 ISR;          /* 0x1C */
    REG32 ICR;          /* 0x20 */
    REG32 RDR;          /* 0x24 */
    REG32 TDR;          /* 0x28 */
} USART_TypeDef;

#define USART1                  ((USART_TypeDef *)USART1_BASE)
#define USART3                  ((USART_TypeDef *)USART3_BASE)

/* USART1 bit fields */
#define USART_CR1_UE            (1UL << 0)
#define USART_CR1_TE            (1UL << 3)
#define USART_CR1_RE            (1UL << 2)
#define USART_CR1_M0            (1UL << 12)   /* 8-bit: M0=0, M1=0 */
#define USART_CR1_M1            (1UL << 28)   /* 7/8/9 bit */
#define USART_CR1_OVER8         (1UL << 15)
#define USART_CR1_RXNEIE        (1UL << 5)    /* Modify 2026.6.24 v23: RXNE interrupt enable (BL ring buf 用) */
#define USART_CR1_TXEIE         (1UL << 7)    /* TXE interrupt enable (未用) */
#define USART_ISR_TXE           (1UL << 7)    /* TX empty */
#define USART_ISR_TC            (1UL << 6)    /* TX complete */
#define USART_ISR_RXNE          (1UL << 5)    /* RX not empty */
#define USART_ISR_ORE           (1UL << 3)    /* Overrun error */

/*============================================================================
 * NVIC (Modify 2026.6.24 v23: BL 用 RXNE 中断, 需要 ISER/ICER + IRQ 编号)
 *  H743 NVIC 基址 0xE000E100, ISER0..7 (set enable), ICER0..7 (clear enable)
 *  USART3_IRQn = 39 (按 H743 中断向量表)
 *===========================================================================*/
#define NVIC_BASE               0xE000E100UL
#define NVIC_ISER0              ((volatile uint32_t *)(NVIC_BASE + 0x000))
#define NVIC_ISER1              ((volatile uint32_t *)(NVIC_BASE + 0x004))
#define NVIC_ISER2              ((volatile uint32_t *)(NVIC_BASE + 0x008))
#define NVIC_ICER0              ((volatile uint32_t *)(NVIC_BASE + 0x080))
#define NVIC_ICER1              ((volatile uint32_t *)(NVIC_BASE + 0x084))
#define NVIC_ICER2              ((volatile uint32_t *)(NVIC_BASE + 0x088))

/* IRQ 编号 (H743, 按 RM0433 表) */
#define USART1_IRQn             37
#define USART2_IRQn             38
#define USART3_IRQn             39

static __inline void NVIC_EnableIRQ(uint32_t irqn)
{
    if (irqn < 32)      *NVIC_ISER0 = (1UL << irqn);
    else if (irqn < 64) *NVIC_ISER1 = (1UL << (irqn - 32));
    else                *NVIC_ISER2 = (1UL << (irqn - 64));
}
static __inline void NVIC_DisableIRQ(uint32_t irqn)
{
    if (irqn < 32)      *NVIC_ICER0 = (1UL << irqn);
    else if (irqn < 64) *NVIC_ICER1 = (1UL << (irqn - 32));
    else                *NVIC_ICER2 = (1UL << (irqn - 64));
}

/*============================================================================
 * I2C1 base (PB8/PB9 - SCL/SDA on AMKN8639)
 *  实际引脚由 product_config.h 决定，但 EEPROM 通常在固定 I2C bus
 *  按 AMKN8639 板默认: I2C1
 *  0x40005400
 *===========================================================================*/
#define I2C1_BASE               0x40005400UL
/* Modify 2026.6.23 P1.5 v7: 加 I2C2 定义 */
#define I2C2_BASE               0x40005800UL
typedef struct {
    REG32 CR1;          /* 0x00 */
    REG32 CR2;          /* 0x04 */
    REG32 OAR1;         /* 0x08 */
    REG32 OAR2;         /* 0x0C */
    REG32 TIMINGR;      /* 0x10 */
    REG32 TIMEOUTR;     /* 0x14 */
    REG32 ISR;          /* 0x18 */
    REG32 ICR;          /* 0x1C */
    REG32 PECR;         /* 0x20 */
    REG32 RXDR;         /* 0x24 */
    REG32 TXDR;         /* 0x28 */
} I2C_TypeDef;

#define I2C1                    ((I2C_TypeDef *)I2C1_BASE)
#define I2C2                    ((I2C_TypeDef *)I2C2_BASE)

#define I2C_CR1_PE              (1UL << 0)
#define I2C_CR1_START           (1UL << 13)
#define I2C_CR1_STOP            (1UL << 14)
#define I2C_CR1_ACK             (1UL << 10)
#define I2C_CR1_SWRST           (1UL << 15)
#define I2C_CR2_NBYTES_SHIFT    16
#define I2C_CR2_RD_WRN          (1UL << 10)
#define I2C_CR2_SADD_SHIFT      0
#define I2C_ISR_TXE             (1UL << 0)
#define I2C_ISR_TXIS            (1UL << 1)
#define I2C_ISR_RXNE            (1UL << 2)
#define I2C_ISR_ADDR            (1UL << 3)
#define I2C_ISR_NACKF           (1UL << 4)
#define I2C_ISR_STOPF           (1UL << 5)
#define I2C_ISR_TC              (1UL << 6)
#define I2C_ISR_TCR             (1UL << 7)
#define I2C_ISR_BERR            (1UL << 8)
#define I2C_ISR_ARLO            (1UL << 9)
#define I2C_ISR_OVR             (1UL << 10)
#define I2C_ISR_PECERR          (1UL << 11)
#define I2C_ISR_TIMEOUT         (1UL << 12)
#define I2C_ISR_ALERT           (1UL << 13)
#define I2C_ISR_BUSY            (1UL << 15)
#define I2C_ISR_DIR             (1UL << 16)
#define I2C_ISR_ADDCODE_SHIFT   17

/* I2C timing for 100kHz @ 64MHz I2CCLK (SYSCLK default after BL) */
#define I2C_TIMING_100KHZ       0x10707DBCUL
#define I2C_TIMING_400KHZ       0x00602173UL

/*============================================================================
 * FLASH base (FLASH controller)
 *  0x52002000
 *  ACR    = 0x00
 *  KEYR   = 0x04
 *  OPTKEYR= 0x08
 *  CR     = 0x0C
 *  SR     = 0x10
 *  CCR    = 0x14
 *  OPTCR  = 0x18
 *  OPTSR  = 0x1C
 *  OPTCCR = 0x24
 *===========================================================================*/
#define FLASH_BASE              0x52002000UL
typedef struct {
    REG32 ACR;          /* 0x00 */
    REG32 KEYR;         /* 0x04 */
    REG32 OPTKEYR;      /* 0x08 */
    REG32 CR;           /* 0x0C */
    REG32 SR;           /* 0x10 */
    REG32 CCR;          /* 0x14 */
    REG32 OPTCR;        /* 0x18 */
    REG32 OPTSR;        /* 0x1C */
    REG32 OPTCCR;       /* 0x20 */
    REG32 PRAR;         /* 0x24 */
    REG32 SCAR;         /* 0x28 */
    REG32 WPSN;         /* 0x2C */
    REG32 CRCR;         /* 0x30 */
    REG32 CRCS;         /* 0x34 */
} FLASH_TypeDef;

#define FLASH                   ((FLASH_TypeDef *)FLASH_BASE)

/* Flash key */
#define FLASH_KEY1              0x45670123UL
#define FLASH_KEY2              0xCDEF89ABUL

/* Flash CR bits */
#define FLASH_CR_PG             (1UL << 0)
#define FLASH_CR_SER            (1UL << 1)
#define FLASH_CR_BER            (1UL << 2)    /* Mass erase (bank 1+2) */
#define FLASH_CR_PSIZE_SHIFT    4
#define FLASH_CR_PSIZE_32       (1UL << FLASH_CR_PSIZE_SHIFT)
#define FLASH_CR_PSIZE_64       (2UL << FLASH_CR_PSIZE_SHIFT)
#define FLASH_CR_FW_START       (1UL << 15)   /* Force write start (H7) */
#define FLASH_CR_START          (1UL << 16)   /* Start erase/program */
#define FLASH_CR_SNB_SHIFT      8            /* Sector number, bits 8..13 */
#define FLASH_CR_SNB_MASK       (0x3FUL << FLASH_CR_SNB_SHIFT)
#define FLASH_CR_LOCK           (1UL << 31)

/* Flash SR bits */
#define FLASH_SR_BSY            (1UL << 0)
#define FLASH_SR_QW             (1UL << 2)    /* Queue wait (H7) */
#define FLASH_SR_WRPERR         (1UL << 8)
#define FLASH_SR_PGSERR         (1UL << 9)
#define FLASH_SR_STRBERR        (1UL << 10)   /* H743 strobe error */
#define FLASH_SR_INCERR         (1UL << 11)   /* H743 */
#define FLASH_SR_OPERR          (1UL << 12)   /* H743 */
#define FLASH_SR_RDPERR         (1UL << 13)   /* H743 RDP */
#define FLASH_SR_RDSERR         (1UL << 14)   /* H743 RDS */
#define FLASH_SR_SNECCERR       (1UL << 15)
#define FLASH_SR_DBECCERR       (1UL << 16)
#define FLASH_SR_EOP            (1UL << 16)   /* End of operation */
#define FLASH_SR_CRCEND         (1UL << 27)

