UFOIO/AMKN8639/BL_BUILD/src_orig/stm32h7xx_regs.h
#define FLASH_ERR_MASK          (FLASH_SR_WRPERR | FLASH_SR_PGSERR | FLASH_SR_STRBERR | \
                                 FLASH_SR_INCERR | FLASH_SR_OPERR | FLASH_SR_RDPERR | \
                                 FLASH_SR_RDSERR | FLASH_SR_SNECCERR | FLASH_SR_DBECCERR)

/*============================================================================
 * IWDG base
 *  0x58004800
 *  KR  = 0x00
 *  PR  = 0x04
 *  RLR = 0x08
 *  SR  = 0x0C
 *===========================================================================*/
#define IWDG_BASE               0x58004800UL
typedef struct {
    REG32 KR;
    REG32 PR;
    REG32 RLR;
    REG32 SR;
    REG32 WINR;
} IWDG_TypeDef;

#define IWDG                    ((IWDG_TypeDef *)IWDG_BASE)
#define IWDG_KEY_RELOAD         0x0000AAAAUL
#define IWDG_KEY_START          0x0000CCCCUL
#define IWDG_KEY_UNLOCK         0x00005555UL

/*============================================================================
 * SCB (System Control Block) - VTOR
 *===========================================================================*/
#define SCS_BASE                0xE000E000UL
typedef struct {
    REG32 CPUID;        /* 0x00 */
    REG32 ICSR;         /* 0x04 */
    REG32 VTOR;         /* 0x08 */
    REG32 AIRCR;        /* 0x0C */
    REG32 SCR;          /* 0x10 */
    REG32 CCR;          /* 0x14 */
    REG32 SHPR[3];      /* 0x18, 0x1C, 0x20 */
    REG32 SHCSR;        /* 0x24 */
    REG32 CFSR;         /* 0x28 */
    REG32 HFSR;         /* 0x2C */
    REG32 DFSR;         /* 0x30 */
    REG32 MMFAR;        /* 0x34 */
    REG32 BFAR;         /* 0x38 */
    REG32 AFSR;         /* 0x3C */
} SCB_Type;

#define SCB                     ((SCB_Type *)SCS_BASE)

/* AIRCR reset */
#define SCB_AIRCR_VECTKEY       (0x5FAUL << 16)
#define SCB_AIRCR_SYSRESETREQ   (1UL << 2)

/*============================================================================
 * CMSIS 兼容内联函数 (避免依赖 cmsis_compiler.h)
 *  ARMCC 5.05 C89 模式:
 *   - 不识别 __attribute__((always_inline)), 用 __inline
 *   - 不识别 "::" GCC 语法, 用单 ":"
 *   - MSR MSP 必须用 r0 寄存器 (AAPCS), 不能用 %0 变量绑定
 *===========================================================================*/
static __inline void __bl_disable_irq(void)
{
    __asm("CPSID I");
}
static __inline void __bl_enable_irq(void)
{
    __asm("CPSIE I");
}
/* ARMCC 函数式内联汇编: r0 即第一个参数 (AAPCS)
 *  Modify 2026.6.23: __asm 函数不能 static, 改用 extern 声明
 *  真正定义移到 bootloader.c (避免多 .o 链接冲突) */
extern void __bl_set_msp(uint32_t sp);
#define __disable_irq   __bl_disable_irq
#define __enable_irq    __bl_enable_irq
#define __set_msp       __bl_set_msp

/*============================================================================
 * QUADSPI (Modify 2026.6.23: P1 W25Q64 驱动用)
 *  H743 QUADSPI 寄存器布局 (基地址 0x52005000, AHB3 总线):
 *   CR   = 0x00  控制 (EN, ABORT, DMAEN, FTHRES, FRCK, ...)
 *   DCR  = 0x04  设备配置 (FMSIZE=23=8MB, CSHT, CKMODE)
 *   SR   = 0x08  状态 (BUSY, TOF, SMF, FT, FRL, FTL)
 *   FCR  = 0x0C  标志清除 (CTOF, CSMF, CFTF, CFR, CFT)
 *   DLR  = 0x10  数据长度 (0-based: 0=1字节, N=N+1字节)
 *   CCR  = 0x14  通信配置 (FMODE, DMODE, DCYC, ADSIZE, ADMODE, IMODE, INSTR)
 *   AR   = 0x18  地址寄存器 (24-bit 或 32-bit)
 *   ABR  = 0x1C  替代字节 (不用)
 *   DR   = 0x20  数据 FIFO (32 字节)
 *===========================================================================*/
#define QUADSPI_BASE            0x52005000UL
typedef struct {
    REG32 CR;           /* 0x00 - Control */
    REG32 DCR;          /* 0x04 - Device Configuration */
    REG32 SR;           /* 0x08 - Status */
    REG32 FCR;          /* 0x0C - Flag Clear */
    REG32 DLR;          /* 0x10 - Data Length */
    REG32 CCR;          /* 0x14 - Communication Configuration */
    REG32 AR;           /* 0x18 - Address */
    REG32 ABR;          /* 0x1C - Alternate Bytes */
    REG32 DR;           /* 0x20 - Data (FIFO) */
    REG32 PSMKR;        /* 0x24 - Polling Status Mask */
    REG32 PSMAR;        /* 0x28 - Polling Status Match */
    REG32 PIR;          /* 0x2C - Polling Interval */
    REG32 LPTR;         /* 0x30 - Low-Power Timeout */
} QUADSPI_TypeDef;

#define QUADSPI                 ((QUADSPI_TypeDef *)QUADSPI_BASE)

/* CR bits */
#define QUADSPI_CR_EN           (1UL << 0)    /* Enable */
#define QUADSPI_CR_ABORT        (1UL << 1)    /* Abort ongoing transfer */
#define QUADSPI_CR_DMAEN        (1UL << 2)    /* DMA enable */
#define QUADSPI_CR_TCEN         (1UL << 3)    /* Timeout counter enable */
#define QUADSPI_CR_DPM          (1UL << 4)    /* Data pack mode (read only mode) */
#define QUADSPI_CR_FTHRES_SHIFT 8             /* FIFO threshold (0..15) */
#define QUADSPI_CR_PRESCALER_SHIFT 24         /* Clock prescaler: f_clk = f_source/(PRESCALER+1) */
#define QUADSPI_CR_FSEL         (1UL << 26)   /* Flash select (BK1/BK2) */
#define QUADSPI_CR_FRCK         (1UL << 30)   /* Force CS low (mem-mapped) */

/* DCR bits */
#define QUADSPI_DCR_CKMODE      (1UL << 0)    /* 0=mode0 (low), 1=mode3 (high) */
#define QUADSPI_DCR_CSHT_SHIFT  8             /* CS high time (cycles+1, 0..7) */
#define QUADSPI_DCR_FMSIZE_SHIFT 16           /* Flash size = 2^(FMSIZE+1) bytes */

/* SR bits */
#define QUADSPI_SR_BUSY         (1UL << 5)    /* BUSY (注意 H743 SR bit 5, 不是 bit 0) */
#define QUADSPI_SR_TOF          (1UL << 4)    /* Timeout flag */
#define QUADSPI_SR_SMF          (1UL << 3)    /* Status match flag */
#define QUADSPI_SR_FTF          (1UL << 2)    /* FIFO threshold flag */
#define QUADSPI_SR_TCF          (1UL << 1)    /* Transfer complete flag */
#define QUADSPI_SR_TEF          (1UL << 0)    /* Transfer error flag */

/* FCR bits */
#define QUADSPI_FCR_CTOF        (1UL << 4)
#define QUADSPI_FCR_CSMF        (1UL << 3)
#define QUADSPI_FCR_CTCF        (1UL << 1)
#define QUADSPI_FCR_CTEF        (1UL << 0)

/* CCR bits (Communication Configuration)
 *  Modify 2026.6.24 v16 P1.5: 全部按 ST 官方 CMSIS 头 stm32h743xx.h 修正
 *    INSTR 实际在 bits 7:0 (不是 23:16)
 *    FMODE 实际在 bits 27:26 (不是 1:0)
 *    DMODE 实际在 bits 25:24 (不是 3:2)
 *    DCYC  实际在 bits 22:18 (5 bits, 不是 7:4)
 *    ADSIZE实际在 bits 13:12 (不是 9:8)
 *    ABMODE实际在 bits 15:14
 *    ABSIZE实际在 bits 17:16
 *    ADMODE bits 11:10 ✓ (本来就对)
 *    IMODE 实际在 bits 9:8  (不是 13:12)
 *  错误源自早期对 RM0433 的误读, 之前 v13-v15 所有 CCR 写入都是错的
 *  验证: CCR=0x003B1A09 (v15 写 0xBB<<16) 实际硬件 INSTR=0x09 (bits 7:0), 不是 0xBB */
#define QUADSPI_CCR_INSTR_SHIFT  0            /* Instruction[7:0]  - 8-bit command */
#define QUADSPI_CCR_IMODE_SHIFT  8            /* 00=none, 01=1-line, 10=2-line, 11=4-line */
#define QUADSPI_CCR_ADMODE_SHIFT 10           /* 00=none, 01=1-line, 10=2-line, 11=4-line */
#define QUADSPI_CCR_ADSIZE_SHIFT 12           /* 00=8b, 01=16b, 10=24b, 11=32b */
#define QUADSPI_CCR_ABMODE_SHIFT 14           /* alternate byte mode */
#define QUADSPI_CCR_ABSIZE_SHIFT 16           /* alternate byte size */
#define QUADSPI_CCR_DCYC_SHIFT   18           /* Dummy cycles (5 bits, 0..31) */
#define QUADSPI_CCR_DMODE_SHIFT  24           /* 00=none, 01=1-line, 10=2-line, 11=4-line */
#define QUADSPI_CCR_FMODE_SHIFT  26           /* 00=ind write, 01=ind read, 10=auto poll, 11=mem-mapped */
#define QUADSPI_CCR_SIOO_SHIFT   28           /* Send Instruction Only Once (mem-mapped) */

