UFOIO/AMKN8639/BL_BUILD/src_orig/stm32h7xx_regs.h
/* 简化的 CCR 组合宏 (Modify 2026.6.24 v16: 全部按 ST CMSIS 修正) */
#define CCR_FMODE_IND_WRITE     (0x0UL << QUADSPI_CCR_FMODE_SHIFT)   /* 0x00000000 */
#define CCR_FMODE_IND_READ      (0x1UL << QUADSPI_CCR_FMODE_SHIFT)   /* 0x04000000 */
#define CCR_DMODE_NONE          (0x0UL << QUADSPI_CCR_DMODE_SHIFT)   /* 0x00000000 */
#define CCR_DMODE_1LINE         (0x1UL << QUADSPI_CCR_DMODE_SHIFT)   /* 0x01000000 */
#define CCR_DMODE_2LINE         (0x2UL << QUADSPI_CCR_DMODE_SHIFT)   /* 0x02000000 (vendor QSPI dual mode) */
#define CCR_DMODE_4LINE         (0x3UL << QUADSPI_CCR_DMODE_SHIFT)   /* 0x03000000 (vendor QSPI quad mode) */
#define CCR_ADSIZE_8            (0x0UL << QUADSPI_CCR_ADSIZE_SHIFT)
#define CCR_ADSIZE_16           (0x1UL << QUADSPI_CCR_ADSIZE_SHIFT)
#define CCR_ADSIZE_24           (0x2UL << QUADSPI_CCR_ADSIZE_SHIFT)   /* W25Q64 用 */
#define CCR_ADSIZE_32           (0x3UL << QUADSPI_CCR_ADSIZE_SHIFT)
#define CCR_ADMODE_NONE         (0x0UL << QUADSPI_CCR_ADMODE_SHIFT)
#define CCR_ADMODE_1LINE        (0x1UL << QUADSPI_CCR_ADMODE_SHIFT)   /* 0x00000400 */
#define CCR_ADMODE_2LINE        (0x2UL << QUADSPI_CCR_ADMODE_SHIFT)   /* 0x00000800 (vendor QSPI dual mode) */
#define CCR_ADMODE_4LINE        (0x3UL << QUADSPI_CCR_ADMODE_SHIFT)   /* 0x00000C00 (vendor QSPI quad mode) */
#define CCR_IMODE_NONE          (0x0UL << QUADSPI_CCR_IMODE_SHIFT)   /* 0x00000000 */
#define CCR_IMODE_1LINE         (0x1UL << QUADSPI_CCR_IMODE_SHIFT)   /* 0x00000100 (W25Q64 0x03/0xBB 等用) */
#define CCR_IMODE_2LINE         (0x2UL << QUADSPI_CCR_IMODE_SHIFT)   /* 0x00000200 */
#define CCR_IMODE_4LINE         (0x3UL << QUADSPI_CCR_IMODE_SHIFT)   /* 0x00000300 */

#endif /* __STM32H7XX_REGS_H__ */
